using System;

namespace _37接口简介
{
    class Program
    {
        static void Main(string[] args)
        {
            //接口是一种规范
            //只要一个类继承了一个接口，这个类就必须实现这个接口中所有的成员
            //为了多态。接口不能被实例化，也就是说，接口不能new（不能创建对象）
            //接口中的成员不能加访问修饰符，接口中的成员访问修饰符为public，不能修改（默认为public）
            //接口中的成员不能有任何实现（“光说不做”，只是定义了一组未实现的成员）
            //接口中只能有方法、(自动)属性、索引器、事件，不能有字段和构造函数
            //接口与接口之间可以继承，并且可以多继承。
            //接口并不能去继承一个类，而类可以继承接口（接口只能继承于接口，而类既可以继承接口，也可以继承类）
            //实现接口的子类必须实现该接口的全部成员
            //一个类可以同时继承一个类并实现多个接口，如果一个子类同时继承了父类A，并实现了接口IA，那么语法上A必须写在IA前面
            //class MyClass:A,IA{}, 因为类是单继承的
            //显示实现接口的目的：解决方法的重名问题
            //什么时候显示的去实现接口：
            //当继承的接口中的方法和参数一模一样的时候，要用显示的实现接口
            //当一个抽象类实现接口的时候，需要子类去实现接口
        }
    }
}
